# SQL

* DBMS es un propgrama que se instala en un computador (**servidor**) y que permite almacenar, modificar y recuperar información de una base de datos.
* Este programa se mantiene eschuchando conexiones (**Listener**) de clientes que desean realizar operaciones sobre la base de datos.
* El usuario (generlamente optro programa) se conecta (**cliente**) al programa y le puede enviar instrucciones en un lenguaje específico (**SQL**).

## Tipos de datos

Caracteres (strings):
* CHAR(n): cadena de caracteres de longitud fija.
* VARCHAR(n): cadena de caracteres de longitud variable.

Numéricos:
* INT: entero.
* FLOAT: número real.
* smallint, bigint, decimal, numeric, real, double precision.

Fecha y hora:
* DATE: fecha.
* TIME: hora. (formato 24 horas)
* TIMESTAMP: fecha y hora.

Otros:
* BOOLEAN: verdadero o falso.
* BLOB: datos binarios.
* CLOB: datos de texto largos.
etc, depende del RDBMS.

## Comentarios en SQL

```sql
-- comentario de una línea
/* comentario
de varias
líneas */
```

## Crear tablas

```sql
CREATE TABLE nombre_tabla (
    nombre_columna tipo_dato [restricciones],
    nombre_columna tipo_dato [restricciones],
    ...
);
```

Ejemplo:

```sql
CREATE TABLE Peliculas(
    id int,
    nombre varchar(30),
    año int,
    categoria varchar(30),
    calificacion float,
    director varchar(30)
);

CREATE TABLE Actores(
    id int,
    nombre varchar(30),
    edad int,
);

/* Tabla de relación 
entre peliocualas y actores,
debido a su relacion (n, n) */

CREATE TABLE Actuo_en(
    id_actor int,
    id_pelicula int,
    PRIMARY KEY(id_actor, id_pelicula)
);
```

## Valores default

```sql
CREATE TABLE nombre_tabla (
    nombre_columna tipo_dato DEFAULT valor_default [restricciones],
    ...
);
```

Ejemplo:

```sql
CREATE TABLE Peliculas(
    id int,
    nombre varchar(30),
    año int DEFAULT 2020,
    categoria varchar(30),
    calificacion float,
    director varchar(30)
)
```

## Modificar Tablas

* Eliminar tabla: `DROP TABLE nombre_tabla;`
* Eliminar atributo: `ALTER TABLE nombre_tabla DROP COLUMN nombre_columna;`
* Agregar atributo: `ALTER TABLE nombre_tabla ADD COLUMN nombre_columna tipo_dato [restricción];`

## Insertar datos

```sql
INSERT INTO nombre_tabla (columna1, columna2, ...)
VALUES (valor1, valor2, ...);
```

Ejemplo:

```sql
INSERT INTO Peliculas (id, nombre, año, categoria, calificacion, director)
VALUES (1, 'Titanic', 1997, 'Romance', 7.8, 'James Cameron');

INSERT INTO Peliculas (id, nombre, año, categoria, calificacion, director)
VALUES (2, 'El Padrino', 1972, 'Drama', 9.2, 'Francis Ford Coppola');
```

Tambien se puede realizar de manera abreviada

```sql
INSERT INTO Peliculas
VALUES (3, 'El Padrino II', 1974, 'Drama', 9.0, 'Francis Ford Coppola');
```

## Cuando poner ;

* Al final de cada instrucción.

## Llaves Foráneas en SQL

Hay error cuando se intenta agregar filas en las que la llave foranea no esta en la tabla referenciada.

```sql
CREATE TABLE Actuo_en(
    id_actor int,
    id_pelicula int,
    PRIMARY KEY(id_actor, id_pelicula),
    FOREIGN KEY(id_actor) REFERENCES Actores(id),
    FOREIGN KEY(id_pelicula) REFERENCES Peliculas(id)
);
```

Este erro pasaría en un caso asi:

```sql
INSERT INTO Actuo_en
VALUES (1, 4);
```

Esto sucede porque no existe un actor con id 4.

## Consultas con SQL

### Forma basica

```sql
SELECT atributos
FROM relaciones
WHERE condiciones;
```

Se utiliza el operador `*` para seleccionar todos los atributos.

Consulta 1: nombre y calificación de todas las películas dirigidas por C.Nolan.

```sql
SELECT nombre, calificacion
FROM Peliculas
WHERE director = 'C.Nolan';
```

Consulta 2: películas estrenadas desde el 2010

```sql
SELECT *
FROM Peliculas
WHERE año >= 2010;
```

## Where que permite?

* Operadores de comparación: `=`, `>`, `<`, `>=`, `<=`, `<>`.
* Operadores lógicos: `AND`, `OR`, `NOT`.
* Operadores de pertenencia: `IN`, `NOT IN`.
* Operadores de rango: `BETWEEN`, `NOT BETWEEN`.
* Operadores de coincidencia: `LIKE`, `NOT LIKE`.
* Operadores de nulidad: `IS NULL`, `IS NOT NULL`.
* Operadores de existencia: `EXISTS`, `NOT EXISTS`.
* Operadores de conjuntos: `UNION`, `INTERSECT`, `EXCEPT`.
* Operadores de agrupación: `GROUP BY`, `HAVING`.
* Operadores de ordenamiento: `ORDER BY`.
* Operadores de limitación: `LIMIT`, `OFFSET`.
* Operadores de conjunción: `JOIN`, `INNER JOIN`, `LEFT JOIN`, `RIGHT JOIN`, `FULL JOIN`, `CROSS JOIN`, `NATURAL JOIN`.
* Operadores de subconsulta: `SELECT`.
* Operadores de agregación: `COUNT`, `SUM`, `AVG`, `MIN`, `MAX`.
* Operadores de ventana: `OVER`.
etc.

## Update

```sql
UPDATE Peliculas
SET calificacion = 0
WHERE nombre = 'Sharknado 6';
```

Update agrega la tupla al final de la tabla.

## DELETE

```sql
DELETE FROM Peliculas
WHERE nombre = 'Sharknado 6';
```

## Que pasa si olvidamos el WHERE?

Se eliminan todas las tuplas de la tabla.
Se actualizan todas las tuplas de la tabla.

Solucion:
* Hacer un backup antes de ejecutar la instrucción.

## Elimar teniendo llaves foráneas

Existen tres opciones:
* `ON DELETE CASCADE`: Elimina las tuplas de la tabla referenciada.
* No pemrituir la eliminacion: Error de sql default
* `ON DELETE SET NULL`: Pone los valores de las llaves foráneas en NULL.

```sql
CREATE TABLE Actuo_en(
    id_actor int,
    id_pelicula int,
    PRIMARY KEY(id_actor, id_pelicula),
    FOREIGN KEY(id_actor) REFERENCES Actores(id) ON DELETE CASCADE,
    FOREIGN KEY(id_pelicula) REFERENCES Peliculas(id) ON DELETE SET NULL
);
```

## Producto CRUZ

```sql
SELECT *
FROM Peliculas, Actuo_en;
```

Lo anterior entrega una tabla de nxm filas.

## Join de algreba rerlacional en SQL

Si agrergasmos un where al producto cruz anterior con una condicicon creamos un join.

```sql
SELECT *
FROM Peliculas, Actuo_en
WHERE Peliculas.id = Actuo_en.id_pelicula;
```

Si queremos los nombres de los actores en vez de los ids.

```sql
SELECT Peliculas.nombre, Actores.nombre
FROM Peliculas, Actuo_en, Actores
WHERE Peliculas.id = Actuo_en.id_pelicula
AND Actores.id = Actuo_en.id_actor;
```

Podemos actortar esta consulta:

```sql
SELECT p.nombre, a.nombre
FROM Peliculas as p, Actuo_en as ae, Actores as a
WHERE p.id = ae.id_pelicula
AND a.id = ae.id_actor;
```

Este tipo de alias no es recomendable.

## Alias para renombrar atributos

podemos realizar operaciones y nombras los atributos nuevos

```sql
SELECT (nombre || 'dirigida por' || director) as creditos, año
FROM Peliculas;
```

Interstellar `dirigida por` C.Nolan || 2014

## Ordenando

Entregue el nombre y la calificación de todas las
películas (orden ascendente):

```sql
SELECT nombre, calificacion
FROM Peliculas
ORDER BY nombre, calificacion;
```

Entregue el nombre y la calificación de todas las
películas (orden descendente):

```sql
SELECT nombre, calificacion
FROM Peliculas
ORDER BY nombre DESC, calificacion;
```

## Union

Entregue el nombre de todos actores y directores:

```sql
SELECT nombre
FROM Actores
UNION
SELECT director
FROM Peliculas;
```

## Operadores de conjuntos

* `UNION`: Une dos conjuntos.
* `INTERSECT`: Intersección de dos conjuntos.
* `EXCEPT`: Diferencia de dos conjuntos.
* `UNION ALL`: Une dos conjuntos, permitiendo duplicados.

## Matching de patrones con Like

s LIKE p: s coincide con el patrón p.
donde p es un **patron** definido mediante:
* `%`: Cualquier secuencia de caracteres.
* `_`: Cualquier caracter. (solo uno)

Ejemplo:

```sql
SELECT *
FROM Peliculas
WHERE nombre LIKE '%Potter%';
```

## Eliminando duplicados

Entregue el nombre de todos actores y directores:

```sql
SELECT DISTINCT nombre
FROM Peliculas;
```

DISTINCT elimina los duplicados. Operador que se aplica a todos los atributos.